emacs/language-modes/python.org
#+auto_tangle: y

#+begin_src emacs-lisp :tangle yes

  (use-package elpy
    :straight t
    :config
    (elpy-enable)
    (setq elpy-modules (delq 'elpy-module-highlight-indentation elpy-modules)))

  (use-package flycheck
    :straight t
    :init (global-flycheck-mode)
    :config
    (when (require 'flycheck nil t)
      (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
      (add-hook 'elpy-mode-hook 'flycheck-mode)))

  (use-package blacken
    :straight t)
#+end_src

If you run into this error:
Debugger entered--Lisp error: (process-sentinel "exited abnormally with code 1")
  signal(process-sentinel ("exited abnormally with code 1"))

Run:

M-x elpy-rpc-reinstall-virtualenv


** evil settings for python mode

This will stop `w`, `e`, and `b` from stopping on the `_` character in variable names

#+begin_src emacs-lisp :tangle yes
  (defun setup-python-evil-word ()
    "Configure evil-words in python-mode."
    (modify-syntax-entry ?_ "w" python-mode-syntax-table))

  (add-hook 'python-mode-hook 'setup-python-evil-word)
#+end_src
